
  #### terraform-plan-nodes.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  [0m[1mdata.terraform_remote_state.bootstrap: Reading...[0m[0m
[0m[1mmodule.tiles-test-node["nuc-g3p-2"].data.terraform_remote_state.bootstrap: Reading...[0m[0m
[0m[1mmodule.talos-node["nuc-g2p-1"].data.terraform_remote_state.bootstrap: Reading...[0m[0m
[0m[1mmodule.talos-node["nuc-g2p-2"].data.terraform_remote_state.bootstrap: Reading...[0m[0m
[0m[1mmodule.talos-node["nuc-g3p-1"].data.terraform_remote_state.bootstrap: Reading...[0m[0m
[0m[1mmodule.talos-node["nuc-g2p-2"].data.terraform_remote_state.bootstrap: Read complete after 0s[0m
[0m[1mmodule.tiles-test-node["nuc-g3p-2"].data.terraform_remote_state.bootstrap: Read complete after 1s[0m
[0m[1mdata.terraform_remote_state.bootstrap: Read complete after 1s[0m
[0m[1mmodule.talos-node["nuc-g3p-1"].data.terraform_remote_state.bootstrap: Read complete after 1s[0m
[0m[1mmodule.talos-node["nuc-g2p-1"].data.terraform_remote_state.bootstrap: Read complete after 1s[0m
[0m[1mdata.proxmox_virtual_environment_nodes.nodes: Reading...[0m[0m
[0m[1mmodule.talos-node["nuc-g3p-1"].proxmox_virtual_environment_download_file.talos_iso: Refreshing state... [id=local:iso/talos-1.11.2-nocloud-amd64.iso][0m
[0m[1mmodule.talos-node["nuc-g2p-1"].proxmox_virtual_environment_download_file.talos_iso: Refreshing state... [id=local:iso/talos-1.11.2-nocloud-amd64.iso][0m
[0m[1mmodule.talos-node["nuc-g3p-2"].proxmox_virtual_environment_download_file.talos_iso: Refreshing state... [id=local:iso/talos-1.11.2-nocloud-amd64.iso][0m
[0m[1mmodule.talos-node["nuc-g2p-2"].proxmox_virtual_environment_download_file.talos_iso: Refreshing state... [id=local:iso/talos-1.11.2-nocloud-amd64.iso][0m
[0m[1mdata.proxmox_virtual_environment_nodes.nodes: Read complete after 0s [id=nodes][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # module.talos-node["nuc-g3p-2"].proxmox_virtual_environment_download_file.talos_iso[0m will be [1m[31mdestroyed[0m
  # (because module.talos-node["nuc-g3p-2"] is not in configuration)
[0m  [31m-[0m[0m resource "proxmox_virtual_environment_download_file" "talos_iso" {
      [31m-[0m[0m content_type        = "iso" [90m-> null[0m[0m
      [31m-[0m[0m datastore_id        = "local" [90m-> null[0m[0m
      [31m-[0m[0m file_name           = "talos-1.11.2-nocloud-amd64.iso" [90m-> null[0m[0m
      [31m-[0m[0m id                  = "local:iso/talos-1.11.2-nocloud-amd64.iso" [90m-> null[0m[0m
      [31m-[0m[0m node_name           = "nuc-g3p-2" [90m-> null[0m[0m
      [31m-[0m[0m overwrite           = false [90m-> null[0m[0m
      [31m-[0m[0m overwrite_unmanaged = false [90m-> null[0m[0m
      [31m-[0m[0m size                = 303378432 [90m-> null[0m[0m
      [31m-[0m[0m upload_timeout      = 600 [90m-> null[0m[0m
      [31m-[0m[0m url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso" [90m-> null[0m[0m
      [31m-[0m[0m verify              = true [90m-> null[0m[0m
    }

[1m  # module.tiles-test-node["nuc-g3p-2"].proxmox_virtual_environment_download_file.talos_iso[0m will be created
[0m  [32m+[0m[0m resource "proxmox_virtual_environment_download_file" "talos_iso" {
      [32m+[0m[0m content_type        = "iso"
      [32m+[0m[0m datastore_id        = "local"
      [32m+[0m[0m file_name           = "talos-1.11.2-nocloud-amd64.iso"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m node_name           = "nuc-g3p-2"
      [32m+[0m[0m overwrite           = false
      [32m+[0m[0m overwrite_unmanaged = false
      [32m+[0m[0m size                = (known after apply)
      [32m+[0m[0m upload_timeout      = 600
      [32m+[0m[0m url                 = "https://factory.talos.dev/image/ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515/v1.11.2/nocloud-amd64.iso"
      [32m+[0m[0m verify              = true
    }

[1m  # module.talos-node["nuc-g2p-1"].module.control.proxmox_virtual_environment_vm.main[0m will be created
[0m  [32m+[0m[0m resource "proxmox_virtual_environment_vm" "main" {
      [32m+[0m[0m acpi                    = true
      [32m+[0m[0m bios                    = "seabios"
      [32m+[0m[0m description             = "Control - 7210 - tiles-cp-nuc-g2p-1 - 10.0.7.21"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ipv4_addresses          = (known after apply)
      [32m+[0m[0m ipv6_addresses          = (known after apply)
      [32m+[0m[0m keyboard_layout         = "en-us"
      [32m+[0m[0m mac_addresses           = (known after apply)
      [32m+[0m[0m migrate                 = false
      [32m+[0m[0m name                    = "tiles-cp-nuc-g2p-1"
      [32m+[0m[0m network_interface_names = (known after apply)
      [32m+[0m[0m node_name               = "nuc-g2p-1"
      [32m+[0m[0m on_boot                 = true
      [32m+[0m[0m protection              = false
      [32m+[0m[0m reboot                  = false
      [32m+[0m[0m reboot_after_update     = true
      [32m+[0m[0m scsi_hardware           = "virtio-scsi-single"
      [32m+[0m[0m started                 = false
      [32m+[0m[0m stop_on_destroy         = false
      [32m+[0m[0m tablet_device           = true
      [32m+[0m[0m tags                    = []
      [32m+[0m[0m template                = false
      [32m+[0m[0m timeout_clone           = 1800
      [32m+[0m[0m timeout_create          = 1800
      [32m+[0m[0m timeout_migrate         = 1800
      [32m+[0m[0m timeout_move_disk       = 1800
      [32m+[0m[0m timeout_reboot          = 1800
      [32m+[0m[0m timeout_shutdown_vm     = 1800
      [32m+[0m[0m timeout_start_vm        = 1800
      [32m+[0m[0m timeout_stop_vm         = 300
      [32m+[0m[0m vm_id                   = 7210

      [32m+[0m[0m agent {
          [32m+[0m[0m enabled = true
          [32m+[0m[0m timeout = "15m"
          [32m+[0m[0m trim    = false
          [32m+[0m[0m type    = "virtio"
        }

      [32m+[0m[0m cdrom {
          [32m+[0m[0m enabled   = false
          [32m+[0m[0m file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso"
          [32m+[0m[0m interface = "ide2"
        }

      [32m+[0m[0m cpu {
          [32m+[0m[0m cores      = 1
          [32m+[0m[0m hotplugged = 0
          [32m+[0m[0m limit      = 0
          [32m+[0m[0m numa       = false
          [32m+[0m[0m sockets    = 1
          [32m+[0m[0m type       = "x86-64-v3"
          [32m+[0m[0m units      = 100
        }

      [32m+[0m[0m disk {
          [32m+[0m[0m aio               = "io_uring"
          [32m+[0m[0m backup            = true
          [32m+[0m[0m cache             = "none"
          [32m+[0m[0m datastore_id      = "local-lvm"
          [32m+[0m[0m discard           = "ignore"
          [32m+[0m[0m file_format       = "raw"
          [32m+[0m[0m interface         = "scsi0"
          [32m+[0m[0m iothread          = true
          [32m+[0m[0m path_in_datastore = (known after apply)
          [32m+[0m[0m replicate         = true
          [32m+[0m[0m size              = 32
          [32m+[0m[0m ssd               = false
        }

      [32m+[0m[0m memory {
          [32m+[0m[0m dedicated      = 3000
          [32m+[0m[0m floating       = 3000
          [32m+[0m[0m keep_hugepages = false
          [32m+[0m[0m shared         = 0
        }

      [32m+[0m[0m network_device {
          [32m+[0m[0m bridge      = "vmbr0"
          [32m+[0m[0m enabled     = true
          [32m+[0m[0m firewall    = true
          [32m+[0m[0m mac_address = "BC:24:11:D0:72:10"
          [32m+[0m[0m model       = "virtio"
          [32m+[0m[0m mtu         = 1
          [32m+[0m[0m queues      = 16
          [32m+[0m[0m rate_limit  = 0
          [32m+[0m[0m vlan_id     = 0
        }

      [32m+[0m[0m operating_system {
          [32m+[0m[0m type = "l26"
        }

      [32m+[0m[0m vga (known after apply)
    }

[1m  # module.talos-node["nuc-g2p-1"].module.control.unifi_user.vm_client[0m will be created
[0m  [32m+[0m[0m resource "unifi_user" "vm_client" {
      [32m+[0m[0m allow_existing         = true
      [32m+[0m[0m fixed_ip               = "10.0.7.21"
      [32m+[0m[0m hostname               = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip                     = (known after apply)
      [32m+[0m[0m local_dns_record       = "tiles-cp-nuc-g2p-1.local.symmatree.com."
      [32m+[0m[0m mac                    = "BC:24:11:D0:72:10"
      [32m+[0m[0m name                   = "tiles-cp-nuc-g2p-1"
      [32m+[0m[0m note                   = "Control - 7210 - tiles-cp-nuc-g2p-1"
      [32m+[0m[0m site                   = (known after apply)
      [32m+[0m[0m skip_forget_on_destroy = false
    }

[1m  # module.talos-node["nuc-g2p-1"].module.worker.proxmox_virtual_environment_vm.main[0m will be created
[0m  [32m+[0m[0m resource "proxmox_virtual_environment_vm" "main" {
      [32m+[0m[0m acpi                    = true
      [32m+[0m[0m bios                    = "seabios"
      [32m+[0m[0m description             = "Worker - 8210 - tiles-wk-nuc-g2p-1 - 10.0.8.21"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ipv4_addresses          = (known after apply)
      [32m+[0m[0m ipv6_addresses          = (known after apply)
      [32m+[0m[0m keyboard_layout         = "en-us"
      [32m+[0m[0m mac_addresses           = (known after apply)
      [32m+[0m[0m migrate                 = false
      [32m+[0m[0m name                    = "tiles-wk-nuc-g2p-1"
      [32m+[0m[0m network_interface_names = (known after apply)
      [32m+[0m[0m node_name               = "nuc-g2p-1"
      [32m+[0m[0m on_boot                 = true
      [32m+[0m[0m protection              = false
      [32m+[0m[0m reboot                  = false
      [32m+[0m[0m reboot_after_update     = true
      [32m+[0m[0m scsi_hardware           = "virtio-scsi-single"
      [32m+[0m[0m started                 = false
      [32m+[0m[0m stop_on_destroy         = false
      [32m+[0m[0m tablet_device           = true
      [32m+[0m[0m tags                    = []
      [32m+[0m[0m template                = false
      [32m+[0m[0m timeout_clone           = 1800
      [32m+[0m[0m timeout_create          = 1800
      [32m+[0m[0m timeout_migrate         = 1800
      [32m+[0m[0m timeout_move_disk       = 1800
      [32m+[0m[0m timeout_reboot          = 1800
      [32m+[0m[0m timeout_shutdown_vm     = 1800
      [32m+[0m[0m timeout_start_vm        = 1800
      [32m+[0m[0m timeout_stop_vm         = 300
      [32m+[0m[0m vm_id                   = 8210

      [32m+[0m[0m agent {
          [32m+[0m[0m enabled = true
          [32m+[0m[0m timeout = "15m"
          [32m+[0m[0m trim    = false
          [32m+[0m[0m type    = "virtio"
        }

      [32m+[0m[0m cdrom {
          [32m+[0m[0m enabled   = false
          [32m+[0m[0m file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso"
          [32m+[0m[0m interface = "ide2"
        }

      [32m+[0m[0m cpu {
          [32m+[0m[0m cores      = 3
          [32m+[0m[0m hotplugged = 0
          [32m+[0m[0m limit      = 0
          [32m+[0m[0m numa       = false
          [32m+[0m[0m sockets    = 1
          [32m+[0m[0m type       = "x86-64-v3"
          [32m+[0m[0m units      = 100
        }

      [32m+[0m[0m disk {
          [32m+[0m[0m aio               = "io_uring"
          [32m+[0m[0m backup            = true
          [32m+[0m[0m cache             = "none"
          [32m+[0m[0m datastore_id      = "local-lvm"
          [32m+[0m[0m discard           = "ignore"
          [32m+[0m[0m file_format       = "raw"
          [32m+[0m[0m interface         = "scsi0"
          [32m+[0m[0m iothread          = true
          [32m+[0m[0m path_in_datastore = (known after apply)
          [32m+[0m[0m replicate         = true
          [32m+[0m[0m size              = 32
          [32m+[0m[0m ssd               = false
        }

      [32m+[0m[0m memory {
          [32m+[0m[0m dedicated      = 7000
          [32m+[0m[0m floating       = 7000
          [32m+[0m[0m keep_hugepages = false
          [32m+[0m[0m shared         = 0
        }

      [32m+[0m[0m network_device {
          [32m+[0m[0m bridge      = "vmbr0"
          [32m+[0m[0m enabled     = true
          [32m+[0m[0m firewall    = true
          [32m+[0m[0m mac_address = "BC:24:11:D0:82:10"
          [32m+[0m[0m model       = "virtio"
          [32m+[0m[0m mtu         = 1
          [32m+[0m[0m queues      = 16
          [32m+[0m[0m rate_limit  = 0
          [32m+[0m[0m vlan_id     = 0
        }

      [32m+[0m[0m operating_system {
          [32m+[0m[0m type = "l26"
        }

      [32m+[0m[0m vga (known after apply)
    }

[1m  # module.talos-node["nuc-g2p-1"].module.worker.unifi_user.vm_client[0m will be created
[0m  [32m+[0m[0m resource "unifi_user" "vm_client" {
      [32m+[0m[0m allow_existing         = true
      [32m+[0m[0m fixed_ip               = "10.0.8.21"
      [32m+[0m[0m hostname               = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip                     = (known after apply)
      [32m+[0m[0m local_dns_record       = "tiles-wk-nuc-g2p-1.local.symmatree.com."
      [32m+[0m[0m mac                    = "BC:24:11:D0:82:10"
      [32m+[0m[0m name                   = "tiles-wk-nuc-g2p-1"
      [32m+[0m[0m note                   = "Worker - 8210 - tiles-wk-nuc-g2p-1"
      [32m+[0m[0m site                   = (known after apply)
      [32m+[0m[0m skip_forget_on_destroy = false
    }

[1m  # module.talos-node["nuc-g2p-2"].module.control.proxmox_virtual_environment_vm.main[0m will be created
[0m  [32m+[0m[0m resource "proxmox_virtual_environment_vm" "main" {
      [32m+[0m[0m acpi                    = true
      [32m+[0m[0m bios                    = "seabios"
      [32m+[0m[0m description             = "Control - 7220 - tiles-cp-nuc-g2p-2 - 10.0.7.22"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ipv4_addresses          = (known after apply)
      [32m+[0m[0m ipv6_addresses          = (known after apply)
      [32m+[0m[0m keyboard_layout         = "en-us"
      [32m+[0m[0m mac_addresses           = (known after apply)
      [32m+[0m[0m migrate                 = false
      [32m+[0m[0m name                    = "tiles-cp-nuc-g2p-2"
      [32m+[0m[0m network_interface_names = (known after apply)
      [32m+[0m[0m node_name               = "nuc-g2p-2"
      [32m+[0m[0m on_boot                 = true
      [32m+[0m[0m protection              = false
      [32m+[0m[0m reboot                  = false
      [32m+[0m[0m reboot_after_update     = true
      [32m+[0m[0m scsi_hardware           = "virtio-scsi-single"
      [32m+[0m[0m started                 = false
      [32m+[0m[0m stop_on_destroy         = false
      [32m+[0m[0m tablet_device           = true
      [32m+[0m[0m tags                    = []
      [32m+[0m[0m template                = false
      [32m+[0m[0m timeout_clone           = 1800
      [32m+[0m[0m timeout_create          = 1800
      [32m+[0m[0m timeout_migrate         = 1800
      [32m+[0m[0m timeout_move_disk       = 1800
      [32m+[0m[0m timeout_reboot          = 1800
      [32m+[0m[0m timeout_shutdown_vm     = 1800
      [32m+[0m[0m timeout_start_vm        = 1800
      [32m+[0m[0m timeout_stop_vm         = 300
      [32m+[0m[0m vm_id                   = 7220

      [32m+[0m[0m agent {
          [32m+[0m[0m enabled = true
          [32m+[0m[0m timeout = "15m"
          [32m+[0m[0m trim    = false
          [32m+[0m[0m type    = "virtio"
        }

      [32m+[0m[0m cdrom {
          [32m+[0m[0m enabled   = false
          [32m+[0m[0m file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso"
          [32m+[0m[0m interface = "ide2"
        }

      [32m+[0m[0m cpu {
          [32m+[0m[0m cores      = 1
          [32m+[0m[0m hotplugged = 0
          [32m+[0m[0m limit      = 0
          [32m+[0m[0m numa       = false
          [32m+[0m[0m sockets    = 1
          [32m+[0m[0m type       = "x86-64-v3"
          [32m+[0m[0m units      = 100
        }

      [32m+[0m[0m disk {
          [32m+[0m[0m aio               = "io_uring"
          [32m+[0m[0m backup            = true
          [32m+[0m[0m cache             = "none"
          [32m+[0m[0m datastore_id      = "local-lvm"
          [32m+[0m[0m discard           = "ignore"
          [32m+[0m[0m file_format       = "raw"
          [32m+[0m[0m interface         = "scsi0"
          [32m+[0m[0m iothread          = true
          [32m+[0m[0m path_in_datastore = (known after apply)
          [32m+[0m[0m replicate         = true
          [32m+[0m[0m size              = 32
          [32m+[0m[0m ssd               = false
        }

      [32m+[0m[0m memory {
          [32m+[0m[0m dedicated      = 3000
          [32m+[0m[0m floating       = 3000
          [32m+[0m[0m keep_hugepages = false
          [32m+[0m[0m shared         = 0
        }

      [32m+[0m[0m network_device {
          [32m+[0m[0m bridge      = "vmbr0"
          [32m+[0m[0m enabled     = true
          [32m+[0m[0m firewall    = true
          [32m+[0m[0m mac_address = "BC:24:11:D0:72:20"
          [32m+[0m[0m model       = "virtio"
          [32m+[0m[0m mtu         = 1
          [32m+[0m[0m queues      = 16
          [32m+[0m[0m rate_limit  = 0
          [32m+[0m[0m vlan_id     = 0
        }

      [32m+[0m[0m operating_system {
          [32m+[0m[0m type = "l26"
        }

      [32m+[0m[0m vga (known after apply)
    }

[1m  # module.talos-node["nuc-g2p-2"].module.control.unifi_user.vm_client[0m will be created
[0m  [32m+[0m[0m resource "unifi_user" "vm_client" {
      [32m+[0m[0m allow_existing         = true
      [32m+[0m[0m fixed_ip               = "10.0.7.22"
      [32m+[0m[0m hostname               = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip                     = (known after apply)
      [32m+[0m[0m local_dns_record       = "tiles-cp-nuc-g2p-2.local.symmatree.com."
      [32m+[0m[0m mac                    = "BC:24:11:D0:72:20"
      [32m+[0m[0m name                   = "tiles-cp-nuc-g2p-2"
      [32m+[0m[0m note                   = "Control - 7220 - tiles-cp-nuc-g2p-2"
      [32m+[0m[0m site                   = (known after apply)
      [32m+[0m[0m skip_forget_on_destroy = false
    }

[1m  # module.talos-node["nuc-g2p-2"].module.worker.proxmox_virtual_environment_vm.main[0m will be created
[0m  [32m+[0m[0m resource "proxmox_virtual_environment_vm" "main" {
      [32m+[0m[0m acpi                    = true
      [32m+[0m[0m bios                    = "seabios"
      [32m+[0m[0m description             = "Worker - 8220 - tiles-wk-nuc-g2p-2 - 10.0.8.22"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ipv4_addresses          = (known after apply)
      [32m+[0m[0m ipv6_addresses          = (known after apply)
      [32m+[0m[0m keyboard_layout         = "en-us"
      [32m+[0m[0m mac_addresses           = (known after apply)
      [32m+[0m[0m migrate                 = false
      [32m+[0m[0m name                    = "tiles-wk-nuc-g2p-2"
      [32m+[0m[0m network_interface_names = (known after apply)
      [32m+[0m[0m node_name               = "nuc-g2p-2"
      [32m+[0m[0m on_boot                 = true
      [32m+[0m[0m protection              = false
      [32m+[0m[0m reboot                  = false
      [32m+[0m[0m reboot_after_update     = true
      [32m+[0m[0m scsi_hardware           = "virtio-scsi-single"
      [32m+[0m[0m started                 = false
      [32m+[0m[0m stop_on_destroy         = false
      [32m+[0m[0m tablet_device           = true
      [32m+[0m[0m tags                    = []
      [32m+[0m[0m template                = false
      [32m+[0m[0m timeout_clone           = 1800
      [32m+[0m[0m timeout_create          = 1800
      [32m+[0m[0m timeout_migrate         = 1800
      [32m+[0m[0m timeout_move_disk       = 1800
      [32m+[0m[0m timeout_reboot          = 1800
      [32m+[0m[0m timeout_shutdown_vm     = 1800
      [32m+[0m[0m timeout_start_vm        = 1800
      [32m+[0m[0m timeout_stop_vm         = 300
      [32m+[0m[0m vm_id                   = 8220

      [32m+[0m[0m agent {
          [32m+[0m[0m enabled = true
          [32m+[0m[0m timeout = "15m"
          [32m+[0m[0m trim    = false
          [32m+[0m[0m type    = "virtio"
        }

      [32m+[0m[0m cdrom {
          [32m+[0m[0m enabled   = false
          [32m+[0m[0m file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso"
          [32m+[0m[0m interface = "ide2"
        }

      [32m+[0m[0m cpu {
          [32m+[0m[0m cores      = 3
          [32m+[0m[0m hotplugged = 0
          [32m+[0m[0m limit      = 0
          [32m+[0m[0m numa       = false
          [32m+[0m[0m sockets    = 1
          [32m+[0m[0m type       = "x86-64-v3"
          [32m+[0m[0m units      = 100
        }

      [32m+[0m[0m disk {
          [32m+[0m[0m aio               = "io_uring"
          [32m+[0m[0m backup            = true
          [32m+[0m[0m cache             = "none"
          [32m+[0m[0m datastore_id      = "local-lvm"
          [32m+[0m[0m discard           = "ignore"
          [32m+[0m[0m file_format       = "raw"
          [32m+[0m[0m interface         = "scsi0"
          [32m+[0m[0m iothread          = true
          [32m+[0m[0m path_in_datastore = (known after apply)
          [32m+[0m[0m replicate         = true
          [32m+[0m[0m size              = 32
          [32m+[0m[0m ssd               = false
        }

      [32m+[0m[0m memory {
          [32m+[0m[0m dedicated      = 7000
          [32m+[0m[0m floating       = 7000
          [32m+[0m[0m keep_hugepages = false
          [32m+[0m[0m shared         = 0
        }

      [32m+[0m[0m network_device {
          [32m+[0m[0m bridge      = "vmbr0"
          [32m+[0m[0m enabled     = true
          [32m+[0m[0m firewall    = true
          [32m+[0m[0m mac_address = "BC:24:11:D0:82:20"
          [32m+[0m[0m model       = "virtio"
          [32m+[0m[0m mtu         = 1
          [32m+[0m[0m queues      = 16
          [32m+[0m[0m rate_limit  = 0
          [32m+[0m[0m vlan_id     = 0
        }

      [32m+[0m[0m operating_system {
          [32m+[0m[0m type = "l26"
        }

      [32m+[0m[0m vga (known after apply)
    }

[1m  # module.talos-node["nuc-g2p-2"].module.worker.unifi_user.vm_client[0m will be created
[0m  [32m+[0m[0m resource "unifi_user" "vm_client" {
      [32m+[0m[0m allow_existing         = true
      [32m+[0m[0m fixed_ip               = "10.0.8.22"
      [32m+[0m[0m hostname               = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip                     = (known after apply)
      [32m+[0m[0m local_dns_record       = "tiles-wk-nuc-g2p-2.local.symmatree.com."
      [32m+[0m[0m mac                    = "BC:24:11:D0:82:20"
      [32m+[0m[0m name                   = "tiles-wk-nuc-g2p-2"
      [32m+[0m[0m note                   = "Worker - 8220 - tiles-wk-nuc-g2p-2"
      [32m+[0m[0m site                   = (known after apply)
      [32m+[0m[0m skip_forget_on_destroy = false
    }

[1m  # module.talos-node["nuc-g3p-1"].module.control.proxmox_virtual_environment_vm.main[0m will be created
[0m  [32m+[0m[0m resource "proxmox_virtual_environment_vm" "main" {
      [32m+[0m[0m acpi                    = true
      [32m+[0m[0m bios                    = "seabios"
      [32m+[0m[0m description             = "Control - 7310 - tiles-cp-nuc-g3p-1 - 10.0.7.31"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ipv4_addresses          = (known after apply)
      [32m+[0m[0m ipv6_addresses          = (known after apply)
      [32m+[0m[0m keyboard_layout         = "en-us"
      [32m+[0m[0m mac_addresses           = (known after apply)
      [32m+[0m[0m migrate                 = false
      [32m+[0m[0m name                    = "tiles-cp-nuc-g3p-1"
      [32m+[0m[0m network_interface_names = (known after apply)
      [32m+[0m[0m node_name               = "nuc-g3p-1"
      [32m+[0m[0m on_boot                 = true
      [32m+[0m[0m protection              = false
      [32m+[0m[0m reboot                  = false
      [32m+[0m[0m reboot_after_update     = true
      [32m+[0m[0m scsi_hardware           = "virtio-scsi-single"
      [32m+[0m[0m started                 = false
      [32m+[0m[0m stop_on_destroy         = false
      [32m+[0m[0m tablet_device           = true
      [32m+[0m[0m tags                    = []
      [32m+[0m[0m template                = false
      [32m+[0m[0m timeout_clone           = 1800
      [32m+[0m[0m timeout_create          = 1800
      [32m+[0m[0m timeout_migrate         = 1800
      [32m+[0m[0m timeout_move_disk       = 1800
      [32m+[0m[0m timeout_reboot          = 1800
      [32m+[0m[0m timeout_shutdown_vm     = 1800
      [32m+[0m[0m timeout_start_vm        = 1800
      [32m+[0m[0m timeout_stop_vm         = 300
      [32m+[0m[0m vm_id                   = 7310

      [32m+[0m[0m agent {
          [32m+[0m[0m enabled = true
          [32m+[0m[0m timeout = "15m"
          [32m+[0m[0m trim    = false
          [32m+[0m[0m type    = "virtio"
        }

      [32m+[0m[0m cdrom {
          [32m+[0m[0m enabled   = false
          [32m+[0m[0m file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso"
          [32m+[0m[0m interface = "ide2"
        }

      [32m+[0m[0m cpu {
          [32m+[0m[0m cores      = 1
          [32m+[0m[0m hotplugged = 0
          [32m+[0m[0m limit      = 0
          [32m+[0m[0m numa       = false
          [32m+[0m[0m sockets    = 1
          [32m+[0m[0m type       = "x86-64-v3"
          [32m+[0m[0m units      = 100
        }

      [32m+[0m[0m disk {
          [32m+[0m[0m aio               = "io_uring"
          [32m+[0m[0m backup            = true
          [32m+[0m[0m cache             = "none"
          [32m+[0m[0m datastore_id      = "local-lvm"
          [32m+[0m[0m discard           = "ignore"
          [32m+[0m[0m file_format       = "raw"
          [32m+[0m[0m interface         = "scsi0"
          [32m+[0m[0m iothread          = true
          [32m+[0m[0m path_in_datastore = (known after apply)
          [32m+[0m[0m replicate         = true
          [32m+[0m[0m size              = 32
          [32m+[0m[0m ssd               = false
        }

      [32m+[0m[0m memory {
          [32m+[0m[0m dedicated      = 3000
          [32m+[0m[0m floating       = 3000
          [32m+[0m[0m keep_hugepages = false
          [32m+[0m[0m shared         = 0
        }

      [32m+[0m[0m network_device {
          [32m+[0m[0m bridge      = "vmbr0"
          [32m+[0m[0m enabled     = true
          [32m+[0m[0m firewall    = true
          [32m+[0m[0m mac_address = "BC:24:11:D0:73:10"
          [32m+[0m[0m model       = "virtio"
          [32m+[0m[0m mtu         = 1
          [32m+[0m[0m queues      = 16
          [32m+[0m[0m rate_limit  = 0
          [32m+[0m[0m vlan_id     = 0
        }

      [32m+[0m[0m operating_system {
          [32m+[0m[0m type = "l26"
        }

      [32m+[0m[0m vga (known after apply)
    }

[1m  # module.talos-node["nuc-g3p-1"].module.control.unifi_user.vm_client[0m will be created
[0m  [32m+[0m[0m resource "unifi_user" "vm_client" {
      [32m+[0m[0m allow_existing         = true
      [32m+[0m[0m fixed_ip               = "10.0.7.31"
      [32m+[0m[0m hostname               = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip                     = (known after apply)
      [32m+[0m[0m local_dns_record       = "tiles-cp-nuc-g3p-1.local.symmatree.com."
      [32m+[0m[0m mac                    = "BC:24:11:D0:73:10"
      [32m+[0m[0m name                   = "tiles-cp-nuc-g3p-1"
      [32m+[0m[0m note                   = "Control - 7310 - tiles-cp-nuc-g3p-1"
      [32m+[0m[0m site                   = (known after apply)
      [32m+[0m[0m skip_forget_on_destroy = false
    }

[1m  # module.talos-node["nuc-g3p-1"].module.worker.proxmox_virtual_environment_vm.main[0m will be created
[0m  [32m+[0m[0m resource "proxmox_virtual_environment_vm" "main" {
      [32m+[0m[0m acpi                    = true
      [32m+[0m[0m bios                    = "seabios"
      [32m+[0m[0m description             = "Worker - 8310 - tiles-wk-nuc-g3p-1 - 10.0.8.31"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ipv4_addresses          = (known after apply)
      [32m+[0m[0m ipv6_addresses          = (known after apply)
      [32m+[0m[0m keyboard_layout         = "en-us"
      [32m+[0m[0m mac_addresses           = (known after apply)
      [32m+[0m[0m migrate                 = false
      [32m+[0m[0m name                    = "tiles-wk-nuc-g3p-1"
      [32m+[0m[0m network_interface_names = (known after apply)
      [32m+[0m[0m node_name               = "nuc-g3p-1"
      [32m+[0m[0m on_boot                 = true
      [32m+[0m[0m protection              = false
      [32m+[0m[0m reboot                  = false
      [32m+[0m[0m reboot_after_update     = true
      [32m+[0m[0m scsi_hardware           = "virtio-scsi-single"
      [32m+[0m[0m started                 = false
      [32m+[0m[0m stop_on_destroy         = false
      [32m+[0m[0m tablet_device           = true
      [32m+[0m[0m tags                    = []
      [32m+[0m[0m template                = false
      [32m+[0m[0m timeout_clone           = 1800
      [32m+[0m[0m timeout_create          = 1800
      [32m+[0m[0m timeout_migrate         = 1800
      [32m+[0m[0m timeout_move_disk       = 1800
      [32m+[0m[0m timeout_reboot          = 1800
      [32m+[0m[0m timeout_shutdown_vm     = 1800
      [32m+[0m[0m timeout_start_vm        = 1800
      [32m+[0m[0m timeout_stop_vm         = 300
      [32m+[0m[0m vm_id                   = 8310

      [32m+[0m[0m agent {
          [32m+[0m[0m enabled = true
          [32m+[0m[0m timeout = "15m"
          [32m+[0m[0m trim    = false
          [32m+[0m[0m type    = "virtio"
        }

      [32m+[0m[0m cdrom {
          [32m+[0m[0m enabled   = false
          [32m+[0m[0m file_id   = "local:iso/talos-1.11.2-nocloud-amd64.iso"
          [32m+[0m[0m interface = "ide2"
        }

      [32m+[0m[0m cpu {
          [32m+[0m[0m cores      = 3
          [32m+[0m[0m hotplugged = 0
          [32m+[0m[0m limit      = 0
          [32m+[0m[0m numa       = false
          [32m+[0m[0m sockets    = 1
          [32m+[0m[0m type       = "x86-64-v3"
          [32m+[0m[0m units      = 100
        }

      [32m+[0m[0m disk {
          [32m+[0m[0m aio               = "io_uring"
          [32m+[0m[0m backup            = true
          [32m+[0m[0m cache             = "none"
          [32m+[0m[0m datastore_id      = "local-lvm"
          [32m+[0m[0m discard           = "ignore"
          [32m+[0m[0m file_format       = "raw"
          [32m+[0m[0m interface         = "scsi0"
          [32m+[0m[0m iothread          = true
          [32m+[0m[0m path_in_datastore = (known after apply)
          [32m+[0m[0m replicate         = true
          [32m+[0m[0m size              = 32
          [32m+[0m[0m ssd               = false
        }

      [32m+[0m[0m memory {
          [32m+[0m[0m dedicated      = 11000
          [32m+[0m[0m floating       = 11000
          [32m+[0m[0m keep_hugepages = false
          [32m+[0m[0m shared         = 0
        }

      [32m+[0m[0m network_device {
          [32m+[0m[0m bridge      = "vmbr0"
          [32m+[0m[0m enabled     = true
          [32m+[0m[0m firewall    = true
          [32m+[0m[0m mac_address = "BC:24:11:D0:83:10"
          [32m+[0m[0m model       = "virtio"
          [32m+[0m[0m mtu         = 1
          [32m+[0m[0m queues      = 16
          [32m+[0m[0m rate_limit  = 0
          [32m+[0m[0m vlan_id     = 0
        }

      [32m+[0m[0m operating_system {
          [32m+[0m[0m type = "l26"
        }

      [32m+[0m[0m vga (known after apply)
    }

[1m  # module.talos-node["nuc-g3p-1"].module.worker.unifi_user.vm_client[0m will be created
[0m  [32m+[0m[0m resource "unifi_user" "vm_client" {
      [32m+[0m[0m allow_existing         = true
      [32m+[0m[0m fixed_ip               = "10.0.8.31"
      [32m+[0m[0m hostname               = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip                     = (known after apply)
      [32m+[0m[0m local_dns_record       = "tiles-wk-nuc-g3p-1.local.symmatree.com."
      [32m+[0m[0m mac                    = "BC:24:11:D0:83:10"
      [32m+[0m[0m name                   = "tiles-wk-nuc-g3p-1"
      [32m+[0m[0m note                   = "Worker - 8310 - tiles-wk-nuc-g3p-1"
      [32m+[0m[0m site                   = (known after apply)
      [32m+[0m[0m skip_forget_on_destroy = false
    }

[1m  # module.tiles-test-node["nuc-g3p-2"].module.control.proxmox_virtual_environment_vm.main[0m will be created
[0m  [32m+[0m[0m resource "proxmox_virtual_environment_vm" "main" {
      [32m+[0m[0m acpi                    = true
      [32m+[0m[0m bios                    = "seabios"
      [32m+[0m[0m description             = "Control - 7320 - tiles-test-cp-nuc-g3p-2 - 10.0.7.32"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ipv4_addresses          = (known after apply)
      [32m+[0m[0m ipv6_addresses          = (known after apply)
      [32m+[0m[0m keyboard_layout         = "en-us"
      [32m+[0m[0m mac_addresses           = (known after apply)
      [32m+[0m[0m migrate                 = false
      [32m+[0m[0m name                    = "tiles-test-cp-nuc-g3p-2"
      [32m+[0m[0m network_interface_names = (known after apply)
      [32m+[0m[0m node_name               = "nuc-g3p-2"
      [32m+[0m[0m on_boot                 = true
      [32m+[0m[0m protection              = false
      [32m+[0m[0m reboot                  = false
      [32m+[0m[0m reboot_after_update     = true
      [32m+[0m[0m scsi_hardware           = "virtio-scsi-single"
      [32m+[0m[0m started                 = false
      [32m+[0m[0m stop_on_destroy         = false
      [32m+[0m[0m tablet_device           = true
      [32m+[0m[0m tags                    = []
      [32m+[0m[0m template                = false
      [32m+[0m[0m timeout_clone           = 1800
      [32m+[0m[0m timeout_create          = 1800
      [32m+[0m[0m timeout_migrate         = 1800
      [32m+[0m[0m timeout_move_disk       = 1800
      [32m+[0m[0m timeout_reboot          = 1800
      [32m+[0m[0m timeout_shutdown_vm     = 1800
      [32m+[0m[0m timeout_start_vm        = 1800
      [32m+[0m[0m timeout_stop_vm         = 300
      [32m+[0m[0m vm_id                   = 7320

      [32m+[0m[0m agent {
          [32m+[0m[0m enabled = true
          [32m+[0m[0m timeout = "15m"
          [32m+[0m[0m trim    = false
          [32m+[0m[0m type    = "virtio"
        }

      [32m+[0m[0m cdrom {
          [32m+[0m[0m enabled   = false
          [32m+[0m[0m file_id   = (known after apply)
          [32m+[0m[0m interface = "ide2"
        }

      [32m+[0m[0m cpu {
          [32m+[0m[0m cores      = 1
          [32m+[0m[0m hotplugged = 0
          [32m+[0m[0m limit      = 0
          [32m+[0m[0m numa       = false
          [32m+[0m[0m sockets    = 1
          [32m+[0m[0m type       = "x86-64-v3"
          [32m+[0m[0m units      = 100
        }

      [32m+[0m[0m disk {
          [32m+[0m[0m aio               = "io_uring"
          [32m+[0m[0m backup            = true
          [32m+[0m[0m cache             = "none"
          [32m+[0m[0m datastore_id      = "local-lvm"
          [32m+[0m[0m discard           = "ignore"
          [32m+[0m[0m file_format       = "raw"
          [32m+[0m[0m interface         = "scsi0"
          [32m+[0m[0m iothread          = true
          [32m+[0m[0m path_in_datastore = (known after apply)
          [32m+[0m[0m replicate         = true
          [32m+[0m[0m size              = 32
          [32m+[0m[0m ssd               = false
        }

      [32m+[0m[0m memory {
          [32m+[0m[0m dedicated      = 3000
          [32m+[0m[0m floating       = 3000
          [32m+[0m[0m keep_hugepages = false
          [32m+[0m[0m shared         = 0
        }

      [32m+[0m[0m network_device {
          [32m+[0m[0m bridge      = "vmbr0"
          [32m+[0m[0m enabled     = true
          [32m+[0m[0m firewall    = true
          [32m+[0m[0m mac_address = "BC:24:11:D0:73:20"
          [32m+[0m[0m model       = "virtio"
          [32m+[0m[0m mtu         = 1
          [32m+[0m[0m queues      = 16
          [32m+[0m[0m rate_limit  = 0
          [32m+[0m[0m vlan_id     = 0
        }

      [32m+[0m[0m operating_system {
          [32m+[0m[0m type = "l26"
        }

      [32m+[0m[0m vga (known after apply)
    }

[1m  # module.tiles-test-node["nuc-g3p-2"].module.control.unifi_user.vm_client[0m will be created
[0m  [32m+[0m[0m resource "unifi_user" "vm_client" {
      [32m+[0m[0m allow_existing         = true
      [32m+[0m[0m fixed_ip               = "10.0.7.32"
      [32m+[0m[0m hostname               = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip                     = (known after apply)
      [32m+[0m[0m local_dns_record       = "tiles-test-cp-nuc-g3p-2.local.symmatree.com."
      [32m+[0m[0m mac                    = "BC:24:11:D0:73:20"
      [32m+[0m[0m name                   = "tiles-test-cp-nuc-g3p-2"
      [32m+[0m[0m note                   = "Control - 7320 - tiles-test-cp-nuc-g3p-2"
      [32m+[0m[0m site                   = (known after apply)
      [32m+[0m[0m skip_forget_on_destroy = false
    }

[1m  # module.tiles-test-node["nuc-g3p-2"].module.worker.proxmox_virtual_environment_vm.main[0m will be created
[0m  [32m+[0m[0m resource "proxmox_virtual_environment_vm" "main" {
      [32m+[0m[0m acpi                    = true
      [32m+[0m[0m bios                    = "seabios"
      [32m+[0m[0m description             = "Worker - 8320 - tiles-test-wk-nuc-g3p-2 - 10.0.8.32"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ipv4_addresses          = (known after apply)
      [32m+[0m[0m ipv6_addresses          = (known after apply)
      [32m+[0m[0m keyboard_layout         = "en-us"
      [32m+[0m[0m mac_addresses           = (known after apply)
      [32m+[0m[0m migrate                 = false
      [32m+[0m[0m name                    = "tiles-test-wk-nuc-g3p-2"
      [32m+[0m[0m network_interface_names = (known after apply)
      [32m+[0m[0m node_name               = "nuc-g3p-2"
      [32m+[0m[0m on_boot                 = true
      [32m+[0m[0m protection              = false
      [32m+[0m[0m reboot                  = false
      [32m+[0m[0m reboot_after_update     = true
      [32m+[0m[0m scsi_hardware           = "virtio-scsi-single"
      [32m+[0m[0m started                 = false
      [32m+[0m[0m stop_on_destroy         = false
      [32m+[0m[0m tablet_device           = true
      [32m+[0m[0m tags                    = []
      [32m+[0m[0m template                = false
      [32m+[0m[0m timeout_clone           = 1800
      [32m+[0m[0m timeout_create          = 1800
      [32m+[0m[0m timeout_migrate         = 1800
      [32m+[0m[0m timeout_move_disk       = 1800
      [32m+[0m[0m timeout_reboot          = 1800
      [32m+[0m[0m timeout_shutdown_vm     = 1800
      [32m+[0m[0m timeout_start_vm        = 1800
      [32m+[0m[0m timeout_stop_vm         = 300
      [32m+[0m[0m vm_id                   = 8320

      [32m+[0m[0m agent {
          [32m+[0m[0m enabled = true
          [32m+[0m[0m timeout = "15m"
          [32m+[0m[0m trim    = false
          [32m+[0m[0m type    = "virtio"
        }

      [32m+[0m[0m cdrom {
          [32m+[0m[0m enabled   = false
          [32m+[0m[0m file_id   = (known after apply)
          [32m+[0m[0m interface = "ide2"
        }

      [32m+[0m[0m cpu {
          [32m+[0m[0m cores      = 3
          [32m+[0m[0m hotplugged = 0
          [32m+[0m[0m limit      = 0
          [32m+[0m[0m numa       = false
          [32m+[0m[0m sockets    = 1
          [32m+[0m[0m type       = "x86-64-v3"
          [32m+[0m[0m units      = 100
        }

      [32m+[0m[0m disk {
          [32m+[0m[0m aio               = "io_uring"
          [32m+[0m[0m backup            = true
          [32m+[0m[0m cache             = "none"
          [32m+[0m[0m datastore_id      = "local-lvm"
          [32m+[0m[0m discard           = "ignore"
          [32m+[0m[0m file_format       = "raw"
          [32m+[0m[0m interface         = "scsi0"
          [32m+[0m[0m iothread          = true
          [32m+[0m[0m path_in_datastore = (known after apply)
          [32m+[0m[0m replicate         = true
          [32m+[0m[0m size              = 32
          [32m+[0m[0m ssd               = false
        }

      [32m+[0m[0m memory {
          [32m+[0m[0m dedicated      = 11000
          [32m+[0m[0m floating       = 11000
          [32m+[0m[0m keep_hugepages = false
          [32m+[0m[0m shared         = 0
        }

      [32m+[0m[0m network_device {
          [32m+[0m[0m bridge      = "vmbr0"
          [32m+[0m[0m enabled     = true
          [32m+[0m[0m firewall    = true
          [32m+[0m[0m mac_address = "BC:24:11:D0:83:20"
          [32m+[0m[0m model       = "virtio"
          [32m+[0m[0m mtu         = 1
          [32m+[0m[0m queues      = 16
          [32m+[0m[0m rate_limit  = 0
          [32m+[0m[0m vlan_id     = 0
        }

      [32m+[0m[0m operating_system {
          [32m+[0m[0m type = "l26"
        }

      [32m+[0m[0m vga (known after apply)
    }

[1m  # module.tiles-test-node["nuc-g3p-2"].module.worker.unifi_user.vm_client[0m will be created
[0m  [32m+[0m[0m resource "unifi_user" "vm_client" {
      [32m+[0m[0m allow_existing         = true
      [32m+[0m[0m fixed_ip               = "10.0.8.32"
      [32m+[0m[0m hostname               = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip                     = (known after apply)
      [32m+[0m[0m local_dns_record       = "tiles-test-wk-nuc-g3p-2.local.symmatree.com."
      [32m+[0m[0m mac                    = "BC:24:11:D0:83:20"
      [32m+[0m[0m name                   = "tiles-test-wk-nuc-g3p-2"
      [32m+[0m[0m note                   = "Worker - 8320 - tiles-test-wk-nuc-g3p-2"
      [32m+[0m[0m site                   = (known after apply)
      [32m+[0m[0m skip_forget_on_destroy = false
    }

[1mPlan:[0m 17 to add, 0 to change, 1 to destroy.
[0m
  ```

  </details>
  
  